Рабочая.Задачи2/src/Catalogs/ЦБР_СтруктураЗадач/ЦБР_СтруктураЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_СтруктураЗадач</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЦБР_Задача</owners>
  <attributes>
    <name>КодСДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
</mdclass:Catalog>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Catalogs/ЦБР_СтруктураЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗаданияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Строка(Объект.ТипЗадания);
	КонецЕсли;
	ОбновитьВидимостьЭлементовНаСервере();
	ОтобразитьНажатиеКнопки(Объект.ТипЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикПриИзменении(Элемент)
	
	Если Объект.Исполнитель = Объект.Аналитик Тогда
		Объект.Аналитик = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущееЗаданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СсылкаНаТекущийЭлемент", Объект.Ссылка);   
	ПараметрыОткрытия.Вставить("СсылкаНаЗадачу", Объект.СсылкаНаЗадачу);
	ОткрытьФорму("Справочник.ЦБР_СтруктураЗадач.Форма.ФормаВыбора" , ПараметрыОткрытия, ЭтотОбъект, , , ,Оповещение ,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	Записать();
	
	ЦБР_СтатусыОбъектовПолныеПрава.ОтправитьНаСогласованиеНаСервере(Объект.Ссылка, Истина);
	
    ЭтаФорма.Прочитать();
	
	ОбновитьВидимостьЭлементовНаСервере();
	
	СостояниеЗадания = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗаданияПользователя(Объект.Ссылка, Объект.Исполнитель);

	//Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.ЦБР_СтруктураЗадач.ПустаяСсылка") Тогда 
	//	ЭтотОбъект.Записать();
	//КонецЕсли;
	//
	//ОтправитьНаСогласованиеСервер();    
	
КонецПроцедуры

&НаКлиенте
Процедура ДатьОценку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект);
	
	НовыеПараметры = Новый Структура;
	НовыеПараметры.Вставить("ТолькоПросмотр", Объект.ОценкаСогласована ИЛИ Объект.Состояние = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ЦБР_Состояние.НаСогласовании"));
	НовыеПараметры.Вставить("ТрудозатратыПлан", Объект.ТрудозатратыПлан);
	НовыеПараметры.Вставить("ТрудозатратыПланОт", Объект.ТрудозатратыПланОт);
	НовыеПараметры.Вставить("ТрудозатратыПланДо", Объект.ТрудозатратыПланДо);
	НовыеПараметры.Вставить("ТрудозатратыПланКомментарий", Объект.ТрудозатратыПланКомментарий);
	НовыеПараметры.Вставить("ВидЧаса", Объект.ВидЧаса);
	НовыеПараметры.Вставить("НетГарантии", Объект.НетГарантии);
	НовыеПараметры.Вставить("ОплатаПоФакту", Объект.ОплатаПоФакту);
	
	ОткрытьФорму("Справочник.ЦБР_СтруктураЗадач.Форма.ФормаОценкиЭтапа", НовыеПараметры, ЭтотОбъект, , , , Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандТипЗадания(Команда)    
	
	АктивированнаяКнопка = Команда.Имя;
	ОбработкаКомандТипЗаданияНаСервере(АктивированнаяКнопка); 
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
		Объект.Наименование = Строка(Объект.ТипЗадания);  
	КонецЕсли;
	ОбновитьВидимостьЭлементовНаСервере();
	
КонецПроцедуры      

&НаСервере
Процедура ОбработкаКомандТипЗаданияНаСервере(АктивированнаяКнопка)
	Для Каждого КомандаФормы ИЗ ЭтотОбъект.Команды Цикл
		Если КомандаФормы.Имя = АктивированнаяКнопка Тогда
			Элементы[АктивированнаяКнопка].Пометка = Истина; 
			ПодсказкаКнопки = ЭтотОбъект.Команды[АктивированнаяКнопка].Подсказка;
		Иначе  
			Попытка
				Элементы[КомандаФормы.Имя].Пометка = Ложь;
			Исключение
				Продолжить; 
			КонецПопытки;
		КонецЕсли;   
	КонецЦикла;
	
	Для Каждого ТипЗадания ИЗ Перечисления.ЦБР_ТипЗадания Цикл
		Если ПодсказкаКнопки = Строка(ТипЗадания) Тогда
			Объект.ТипЗадания = ТипЗадания;
			Возврат;
		КонецЕсли;
	КонецЦикла;    
	
КонецПроцедуры 

&НаСервере
Процедура ОтобразитьНажатиеКнопки(ТипЗадания)
	
	Для Каждого КомандаФормы ИЗ ЭтотОбъект.Команды Цикл  
		Если ЭтотОбъект.Команды[КомандаФормы.Имя].Подсказка = Строка(ТипЗадания) Тогда
			Попытка
				Элементы[КомандаФормы.Имя].Пометка = Истина;
			Исключение
				Продолжить; 
			КонецПопытки; 
		Иначе 
			Попытка
				Элементы[КомандаФормы.Имя].Пометка = Ложь;
			Исключение
				Продолжить; 
			КонецПопытки;  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьЭлементовНаСервере()
	
	Если Объект.ТипЗадания = Перечисления.ЦБР_ТипЗадания.Разработка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Аналитик", "Видимость", Истина);		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Аналитик", "Видимость", Ложь);				
	КонецЕсли;
	
	Если Объект.Состояние = Перечисления.ЦБР_Состояние.Черновик И
		(Объект.ТрудозатратыПлан > 0 Или Объект.ОплатаПоФакту) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтправитьНаСогласование", "Видимость", Истина);		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтправитьНаСогласование", "Видимость", Ложь);						
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТрудозатратыПланПредставление) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "группаОценка", "Видимость", Истина);   
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "группаОценка", "Видимость", Ложь);
	КонецЕсли;    
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьЗаголовокГиперссылок()
	
	Если ЗначениеЗаполнено(Объект.ТрудозатратыПланПредставление) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаОценкаЗадачи", "Заголовок", "Переоценить");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаОценкаЗадачи", "Заголовок", "Дать оценку");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.ЦБР_СтруктураЗадач") Тогда
		Объект.ПредыдущееЗадание = Результат; 
	ИначеЕсли Результат <> Неопределено Тогда
		УстановитьПредставлениеТрудозатрат(Результат);  
		ОбновитьВидимостьЭлементовНаСервере(); 
		ОбновитьЗаголовокГиперссылок();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьПредставлениеТрудозатрат(Результат)
	
	Объект.ВидЧаса = Результат.ВидЧаса;
	Объект.ТрудозатратыПланКомментарий = Результат.ТрудозатратыПланКомментарий;
	Объект.НетГарантии = Результат.НетГарантии;
	
	Если Результат.ТипОценки = "Точная" Тогда
		Объект.ТрудозатратыПлан = Результат.ТрудозатратыПлан;		
		Объект.ТрудозатратыПланПредставление = СтрШаблон("%1", Объект.ТрудозатратыПлан);
		Объект.ОплатаПоФакту = Ложь;
	ИначеЕсли Результат.ТипОценки = "Рамочная" Тогда
		Объект.ТрудозатратыПланОт = Результат.ТрудозатратыПланОт;
		Объект.ТрудозатратыПланДо = Результат.ТрудозатратыПланДо;
		Объект.ТрудозатратыПланПредставление = СтрШаблон("От %1 до %2", Объект.ТрудозатратыПланОт,
		Объект.ТрудозатратыПланДо);
		Объект.ОплатаПоФакту = Ложь;
	ИначеЕсли Результат.ТипОценки = "ПоФакту" Тогда
		Объект.ТрудозатратыПланПредставление = "По факту";
		Объект.ОплатаПоФакту = Истина;
		
	Иначе
		Объект.ТрудозатратыПланПредставление = "";
		Объект.ВидЧаса = Неопределено;
		Объект.ОплатаПоФакту = Ложь; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСогласованноеЗадание()
	
	//Пересогласование = Документы.ЦБР_Задание.ПустаяСсылка();	
	//Задание = Документы.ЦБР_Задание.СоздатьДокумент();
	//Если ЗначениеЗаполнено(Объект.СсылкаНаЗадание) Тогда
	//	Пересогласование = Объект.СсылкаНаЗадание.ПолучитьОбъект();
	//	ЗаполнитьЗначенияСвойств(Задание, Пересогласование); 
	//	Задание.ЭффективныеЧасы.Загрузить(Пересогласование.ЭффективныеЧасы.Выгрузить());
	//КонецЕсли;
	//ЗаполнитьЗначенияСвойств(Задание, Объект);
	//Задание.Дата = ТекущаяДатаСеанса();
	//Задание.СсылкаНаЗадачу = Объект.Владелец;
	//Задание.СсылкаНаСтруктуру = Объект;
	//Задание.Постановщик = Объект.Владелец.Постановщик;
	//Задание.Подразделение = Задание.Исполнитель.Подразделение;
	//Задание.СсылкаНаЭтапТестирования = Объект.ПредыдущееЗадание;
	//Задание.УникальныйИдентификаторЗадания = Строка(Новый УникальныйИдентификатор);
	//Задание.Номер = "";
	//Задание.Записать(РежимЗаписиДокумента.Проведение);
	//
	//Если ЗначениеЗаполнено(Пересогласование.Ссылка) Тогда
	//	Уведомление = СтрШаблон("Изменено количество согласованных часов! Было: %1 Стало: %2", Пересогласование.ТрудозатратыПлан, Задание.ТрудозатратыПлан);
	//	Получатели = Новый Массив();
	//	Получатели.Добавить(Задание.Исполнитель);
	//	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Объект.Владелец, "ИзменениеОценки", Получатели, Уведомление);
	//	ЦБР_ЗадачиЗаданияВызовСервера.ЗаменитьОсПоПересогласованию(Пересогласование.Ссылка, Задание.Ссылка);
	//УстановитьПривилегированныйРежим(Истина);
	//Пересогласование.Удалить();
	//УстановитьПривилегированныйРежим(Ложь);
	//КонецЕсли;
	//Если Объект.Владелец.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные Тогда
	//	Списалось = ЦБР_ЗадачиЗаданияВызовСервера.СписатьПредсогласованныеЧасы(Объект.Владелец, Объект.ТрудозатратыПлан, , Объект.СсылкаНаЗадание);
	//КонецЕсли;
	
	//Объект.СсылкаНаЗадание = Документы.ЦБР_Задание.СоздатьНовоеЗадание(Объект); 
	
КонецПроцедуры

#КонецОбласти
